huybk213/nrf52-sdk5-privacy-address-with-whitelist/ble_app_uart_c/main.c
/**@brief Function for initializing privacy.
 *
 * @note Privacy is used to check if the peer supports ranging.
 */
static void privacy_init(void)
{
        m_irk = DM_PUBLIC_IRK;
        m_id_addr = DM_PUBLIC_ADDR;

        //ble_gap_id_key_t id_irk = {
        //        .id_info = m_irk,
        //        .id_addr_info = m_id_addr
        //};
        //m_key_ptrs[0] = &id_irk;

        //ble_gap_privacy_params_t privacy = {
        //        .privacy_mode = BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY,
        //        .private_addr_type = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
        //        .private_addr_cycle_s = 0,
        //        .p_device_irk = &m_irk
        //};

        //APP_ERROR_CHECK(sd_ble_gap_privacy_set(&privacy));

        //if(NRF_SUCCESS != sd_ble_gap_device_identities_set((const ble_gap_id_key_t**) &m_key_ptrs[0], NULL, 1))
        //{
        //        APP_ERROR_CHECK(false);
        //}

        NRF_LOG_INFO("Key set");
}


/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nus_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function to start scanning. */
static void scan_start(void)
{
        ret_code_t ret;

        //Check the whitelist if empty, use without whitelist
        if (nrf_ble_whitelist_cnt()==0)
        {
                m_whitelist_disabled = true;
        }

        ret = nrf_ble_scan_start(&m_scan);
        APP_ERROR_CHECK(ret);

        ret = bsp_indication_set(BSP_INDICATE_SCANNING);
        APP_ERROR_CHECK(ret);
}


static void on_whitelist_req(void)
{
        ret_code_t ret;
        if (((nrf_ble_whitelist_cnt() == 0)) ||
            (m_whitelist_disabled))
        {
                m_scan_param.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
                ret = nrf_ble_scan_params_set(&m_scan, &m_scan_param);
                APP_ERROR_CHECK(ret);
                NRF_LOG_INFO("on_whitelist_req BLE_GAP_SCAN_FP_ACCEPT_ALL");
        }
        else
        {
                ret = nrf_ble_whitelist_enable();
                APP_ERROR_CHECK(ret);

                ble_gap_id_key_t id_irk = {
                        .id_info = m_irk,
                        .id_addr_info = m_id_addr
                };
                m_key_ptrs[0] = &id_irk;

                if(NRF_SUCCESS != sd_ble_gap_device_identities_set((const ble_gap_id_key_t**) &m_key_ptrs[0], NULL, 1))
                {
                        APP_ERROR_CHECK(false);
                }
                NRF_LOG_INFO("on_whitelist_req IRK");
        }
}

/**@brief Function for disabling the use of the whitelist for scanning.
 */
static void whitelist_disable(void)
{
        if (!m_whitelist_disabled)
        {
                NRF_LOG_INFO("Whitelist temporarily disabled.");
                m_whitelist_disabled = true;
                nrf_ble_scan_stop();
                scan_start();
        }
}

/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
        ret_code_t err_code;

        switch(p_scan_evt->scan_evt_id)
        {
        case NRF_BLE_SCAN_EVT_WHITELIST_REQUEST:
        {
                NRF_LOG_INFO("NRF_BLE_SCAN_EVT_WHITELIST_REQUEST");
                on_whitelist_req();
                m_whitelist_disabled = false;
        }
        break;
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
        {
                err_code = p_scan_evt->params.connecting_err.err_code;
                APP_ERROR_CHECK(err_code);
        } break;

        case NRF_BLE_SCAN_EVT_CONNECTED:
        {
                ble_gap_evt_connected_t const * p_connected =
                        p_scan_evt->params.connected.p_connected;
                // Scan is automatically stopped by the connection.
                NRF_LOG_INFO("Connecting to target %02x%02x%02x%02x%02x%02x",
                             p_connected->peer_addr.addr[0],
                             p_connected->peer_addr.addr[1],
                             p_connected->peer_addr.addr[2],
                             p_connected->peer_addr.addr[3],
                             p_connected->peer_addr.addr[4],
                             p_connected->peer_addr.addr[5]
                             );
        } break;

        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
        } break;

        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
                NRF_LOG_INFO("NRF_BLE_SCAN_EVT_FILTER_MATCH");
                break;
        case NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT:
                NRF_LOG_INFO("NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT");
                break;
        default:
                break;
        }
}


/**@brief Function for initializing the scanning and setting the filters.
 */
static void scan_init(void)
{
        ret_code_t err_code;
        nrf_ble_scan_init_t init_scan;

        memset(&init_scan, 0, sizeof(init_scan));

        init_scan.p_scan_param     = &m_scan_param;
        init_scan.connect_if_match = true;
        init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

        err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
        APP_ERROR_CHECK(err_code);

        //err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
        //APP_ERROR_CHECK(err_code);

        //err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
        //APP_ERROR_CHECK(err_code);

//        if (strlen(m_target_periph_name) != 0)
//        {
//                err_code = nrf_ble_scan_filter_set(&m_scan,
//                                                   SCAN_NAME_FILTER,
//                                                   m_target_periph_name);
//                APP_ERROR_CHECK(err_code);
//        }
//        err_code = nrf_ble_scan_filters_enable(&m_scan,
//                                               NRF_BLE_SCAN_NAME_FILTER,
//                                               false);

        memcpy(&m_target_periph_addr, &m_id_addr, sizeof(ble_gap_addr_t));
        if (is_connect_per_addr)
        {
                err_code = nrf_ble_scan_filter_set(&m_scan,
                                                   SCAN_ADDR_FILTER,
                                                   m_target_periph_addr.addr);
                APP_ERROR_CHECK(err_code);
        }
        err_code = nrf_ble_scan_filters_enable(&m_scan,
                                               NRF_BLE_SCAN_ADDR_FILTER,
                                               false);
        APP_ERROR_CHECK(err_code);

